### DataFrame에서 행/열 삭제

In [2]:
# 모듈로딩
import pandas as pd

In [3]:
# 데이터 준비
data={'name':['홍길동','마징가','원더우면'],
      'job':['의적','로봇','영웅'],
      'gender':['남','남','여'],
      'age':[100,200,300],
      'height':[180,300,200]}

In [4]:
# DF로 데이터 저장
dataDF=pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우면  영웅      여  300     200

- [실습] 1번행을 삭제 : 변수명.drop()메서드

- [실습] 행 삭제 : 변수명.drop()메서드
    - 변수명.drop(labels,axis=0) : axis의 설정 값에 따라 행 또는 열 삭제 진행
    - 변수명.drop(index): 지정된 인덱스의 행 삭제

In [5]:
# 1개 행 삭제 => 기본값 : 행 삭제, 원본변경x
dataDF.drop(1)

   name job gender  age  height
0   홍길동  의적      남  100     180
2  원더우면  영웅      여  300     200

In [6]:
# 2개 행 삭제 => 기본값 : 행 삭제, 원본변경x / 원본 변경시키려면 ,inplace=True
dataDF.drop([0,2])

  name job gender  age  height
1  마징가  로봇      남  200     300

- [실습] 열/컬럼 삭제 : 변수명.drop( ,axis=1 또는 axis='columns')메서드
    - 삭제 방향 즉, 기준을 열로 설정 필수
- [실습] 행 삭제 : 변수명.drop()메서드
    - 변수명.drop(labels,axis=0) : axis의 설정 값에 따라 행 또는 열 삭제 진행
    - 변수명.drop(index): 지정된 인덱스의 행 삭제

In [7]:
## age 컬럼을 삭제
dataDF.drop('age',axis=1)

   name job gender  height
0   홍길동  의적      남     180
1   마징가  로봇      남     300
2  원더우면  영웅      여     200

In [8]:
# gender, height 컬럼 삭제
dataDF.drop('gender',axis=1)
dataDF.drop('height',axis=1)

   name job gender  age
0   홍길동  의적      남  100
1   마징가  로봇      남  200
2  원더우면  영웅      여  300

In [11]:
# 컬럼 슬라이싱으로 삭제
dataDF.drop(dataDF.columns[::2],axis=1)

  job  age
0  의적  100
1  로봇  200
2  영웅  300

In [12]:
dataDF.drop(columns=dataDF.columns[::2])

  job  age
0  의적  100
1  로봇  200
2  영웅  300